In [6]:
import numpy as np
import pandas as pd

In [11]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atil"],
          "Spor" : ["Kosu","Yuzme", "Kosu", "Basketbol"],
          "Kalori" : [100,200,300,400]}
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [12]:
sozluk2 = {"Isim" : ["Osman", "Levent", "Atlas", "Fatma"],
          "Spor" : ["Kosu","Yuzme", "Kosu", "Basketbol"],
          "Kalori" : [100,200,250,150]}
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame2

     Isim       Spor  Kalori
4   Osman       Kosu     100
5  Levent      Yuzme     200
6   Atlas       Kosu     250
7   Fatma  Basketbol     150

In [13]:
sozluk3 = {"Isim" : ["Ayse", "Mahmut", "Duygu", "Nur"],
          "Spor" : ["Kosu","Yuzme", "Badminton", "Tenis"],
          "Kalori" : [400,500,100,400]}
dataFrame3 = pd.DataFrame(sozluk3, [8,9,10,11])
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kosu     400
9   Mahmut      Yuzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     400

## concatenation

In [26]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     300
3     Atil  Basketbol     400
4    Osman       Kosu     100
5   Levent      Yuzme     200
6    Atlas       Kosu     250
7    Fatma  Basketbol     150
8     Ayse       Kosu     400
9   Mahmut      Yuzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     400

## merge

In [28]:
mergeSozluk1 = {"Isim": ["Ahmet", "Mehmet", "Zeynep","Atil"],
               "Spor" : ["Kosu","Yuzme","Kosu","Basketbol"]}

In [29]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [33]:
mergeSozluk2 = {"Isim": ["Ahmet", "Mehmet", "Zeynep","Atil"],
               "Kalori" : [100,200,300,400]}

In [34]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atil     400

In [35]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3    Atil  Basketbol     400

In [36]:
maasSozluk = {"Isim": ["Atil","Zeynep","Mehmet","Ahmet"],
             "Departman":["Yazilim","Satis","Pazarlama","Yazilim"],
             "Maas":[200,300,400,500]}
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazilim   200
1  Zeynep      Satis   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazilim   500

In [37]:
maasDataFrame["Departman"]

0      Yazilim
1        Satis
2    Pazarlama
3      Yazilim
Name: Departman, dtype: object

In [38]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [39]:
maasDataFrame.nunique()

Isim         4
Departman    3
Maas         4
dtype: int64

In [45]:
def bruttenNete(maas):
    return maas * 0.66

In [46]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [47]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [50]:
yeniBirVeri = {"Karakter Sinifi":["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas":[9,10,50,20,10]}
karakterDF=pd.DataFrame(yeniBirVeri)
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [52]:
karakterDF.pivot_table(values = "Karakter Yas",index=["Karakter Sinifi", "Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10